package spring.basic;

public class SpringBasicPrinciple {

  /**
   * Spring Basic Principle
   *
   * 1. Spring history
   *
   * ◆ 자바 진영의 추운 겨울과 스프링의 탄생
   *
   * 2000년대 초반 자바 진영의 표준 기술 EJB (Enterprise Java Beans) 이 있었다.
   * 이 기술은 그 당시 표준 기술이었고 다양한 기능들을 갖추고 있었기에 현장에서 많이 보급되고 사용되고 있었다.
   *
   * 그러나 EJB 기술은 현실적으로 비용이 너무 비싸고 무엇보다도 기술을 사용하는 방식이 너무 불친절했고 설정 방식도 복잡하다는 문제점을 가지고 있었다.
   * 오히려 이 기술을 사용함으로서 얻는 이익보다 감수해야 하는 비용이 더 크다고 판단하여, 반대로 이런 기술을 쓰지 않고 순수한 자바 코드만으로 개발하는
   * POJO(Plain Old Java Object) 라는 작업 방식이 등장했다.
   *
   * 그리고 이 상황을 답답하게 여긴 개발자 로드 존슨이 EJB 를 비판하며 새로운 코드를 공개하는데 이것이 훗날 스프링 프레임워크로 발전한다.
   *
   *
   * ◆ Spring 의 역사
   *
   * -2002년 로드 존슨 책 발표.
   * -EJB 가 가지고 있는 문제점을 지적.
   * -EJB 가 없이도 충분히 고품질의 확장 가능한 애플리케이션을 개발할 수 있음을 보여주고 30,000 라인 이상의 예제 코드를 공개함.
   * -지금의 스프링 핵심 개념과 모든 기반 코드가 녹아들어 있음.
   * -BeanFactory, ApplicationContext,...
   * -책은 발표되자마자 유명해졌으며 개발자들이 책의 코드를 자신들의 프로젝트에 사용하기 시작함.
   *
   * -책 출간 직후 유겐 휠러, 얀 카로프라는 두 개발자가 로드 존슨에게 오픈소스 프로젝트를 제안.
   * -스프링 핵심 코드는 아직도 유겐 휠러가 개발을 담당하고 있다.
   * -암울했던 EJB 라는 춥고 힘든 겨울을 넘어 이 기술이 새로운 봄이 될것이라는 뜻에서 스프링으로 명명.
   *
   * -2003년 스프링 프레임워크 1.0 출시: XML
   * -2006년 스프링 프레임워크 2.0 출시: XML 편의 기능 지원
   * -2009년 스프링 프레임워크 3.0 출시: 자바 코드 설정 지원
   * -2013년 스프링 프레임워크 4.0 출시: 자바8
   * -2014년 스프링부트 1.0 출시
   * -2017년 스프링 프레임워크 5.0 스프링부트 2.0 출시 -리액티브 프로그래밍 지원
   * -2020년 9월 현재 스프링 프레임워크 5.2.x, 스프링 부트 2.3.x
   *
   *
   *
   *
   *
   *
   *
   *
   */

}
