package spring.basic;

public class SpringBasicPrinciple {

  /**
   * Spring Basic Principle
   *
   * 1. Spring history
   *
   * ◆ 자바 진영의 추운 겨울과 스프링의 탄생
   * 2000년대 초반 자바 진영의 표준 기술 EJB (Enterprise Java Beans) 이 있었다.
   * 이 기술은 그 당시 표준 기술이었고 다양한 기능들을 갖추고 있었기에 현장에서 많이 보급되고 사용되고 있었다.
   * 그러나 EJB 기술은 현실적으로 비용이 너무 비싸고 무엇보다도 기술을 사용하는 방식이 너무 불친절했고 설정 방식도 복잡하다는 문제점을 가지고 있었다.
   * 오히려 이 기술을 사용함으로서 얻는 이익보다 감수해야 하는 비용이 더 크다고 판단하여, 반대로 이런 기술을 쓰지 않고 순수한 자바 코드만으로 개발하는
   * POJO(Plain Old Java Object) 라는 작업 방식이 등장했다.
   * 그리고 이 상황을 답답하게 여긴 개발자 로드 존슨이 EJB 를 비판하며 새로운 코드를 공개하는데 이것이 훗날 스프링 프레임워크로 발전한다.
   *
   * ◆ Spring 의 역사
   * -2002년 로드 존슨 책 발표.
   * -EJB 가 가지고 있는 문제점을 지적.
   * -EJB 가 없이도 충분히 고품질의 확장 가능한 애플리케이션을 개발할 수 있음을 보여주고 30,000 라인 이상의 예제 코드를 공개함.
   * -지금의 스프링 핵심 개념과 모든 기반 코드가 녹아들어 있음.
   * -BeanFactory, ApplicationContext,...
   * -책은 발표되자마자 유명해졌으며 개발자들이 책의 코드를 자신들의 프로젝트에 사용하기 시작함.
   *
   * -책 출간 직후 유겐 휠러, 얀 카로프라는 두 개발자가 로드 존슨에게 오픈소스 프로젝트를 제안.
   * -스프링 핵심 코드는 아직도 유겐 휠러가 개발을 담당하고 있다.
   * -암울했던 EJB 라는 춥고 힘든 겨울을 넘어 이 기술이 새로운 봄이 될것이라는 뜻에서 스프링으로 명명.
   *
   * -2003년 스프링 프레임워크 1.0 출시: XML
   * -2006년 스프링 프레임워크 2.0 출시: XML 편의 기능 지원
   * -2009년 스프링 프레임워크 3.0 출시: 자바 코드 설정 지원
   * -2013년 스프링 프레임워크 4.0 출시: 자바8
   * -2014년 스프링부트 1.0 출시
   * -2017년 스프링 프레임워크 5.0 스프링부트 2.0 출시 -리액티브 프로그래밍 지원
   * -2020년 9월 현재 스프링 프레임워크 5.2.x, 스프링 부트 2.3.x
   *
   * 2. What is Spring Framework?
   * 현재에서 와서 스프링이란 어떤 특정한 기술을 의미하는 것이 아니라 스프링을 기반으로 한 여러 가지 기술들을 모인 생태계라고 볼 수 있다.
   * ex) 스프링 프레임워크, 스프링 부트, 스프링 데이터, 스프링 세션, 스프링 배치, 스프링 클라우드 등등..
   *
   * Spring 공식 기술 사이트: spring.io 에 가보면 수많은 스프링 프로젝트가 존재한다.
   *
   * 물론 그 중에서 가장 핵심이 되는 기술은 스프링 프레임워크이다. 그리고 이 스프링 기술들을 편하게 사용할 수 있도록 도와주는 스프링 부트가 있다.
   *
   * ◆ 스프링 프레임워크에는 다양한 내용들이 있는데, 이것들을 분류하자면 다음과 같다.
   * ① 핵심 기술: 스프링 DI 컨테이너, AOP, 이벤트, ...
   * ② 웹 기술: 스프링 MVC, 스프링 WebFlux
   * ③ 데이터 접근 기술: 트랜잭션, JDBC, ORM 지원, XML
   * ④ 기술 통합: 캐시, 이메일, 원격 접근, 스케줄링
   * ⑤ 테스트: 스프링 기반 테스트 지원
   * ⑥ 언어: kotlin, Groovy
   *
   * ◆ SpringBoot
   * -스프링을 편하게 사용할 수 있도록 지원, 최근에 와서는 거의 기본 베이스로 사용되는 기술
   * -단독으로 실행할 수 있는 스프링 애플리케이션을 쉽게 생성할 수 있다.
   * -Tomcat 같은 웹 서버를 내장하고 있기 때문에 별도의 웹 서버를 설치하지 않아도 된다.
   * -간편한 build 구성을 위해 starter 종속성을 제공한다.
   * -스프링과 연계된 외부 라이브러리를 자동으로 구성해준다.
   * -메트릭, 상태 확인, 외부 구성 프로덕션 기능 제공
   * -관례에 의한 간결한 설정
   *
   * ◆ 스프링의 핵심 컨셉
   * 스프링은 대체 왜 만들어졌는가?
   * 모든 기술은 핵심 컨셉과 개념을 이해하는 것이 매우 중요하다. 나머지는 사실 부차적인 것들이다.
   * 이 핵심 컨셉에 대해서 이 기술을 왜 만들었는지를 제대로 이해하고 사용해야 내 것이 된다.
   * 그러나 그 개념을 이해하지 못한 채 스프링을 사용한다면 그냥 API 사용법을 달달 암기해서 내 코드에 복사 붙여넣기 하는 것과 다를 바 없다.
   *
   * 스프링의 진짜 핵심은 다음과 같다.
   * 스프링은 자바 언어로 만들어진 프레임워크다.
   * 그렇다면 자바 언어가 가진 특징은 무엇일까? 객체 지향 언어.
   * 스프링은 객체 지향 언어가 가진 강력한 특징을 살려내는 프레임워크다.
   * 다시 말해, 스프링은 좋은 객체 지향 애플리케이션을 개발할 수 있게 도와주는 프레임워크이다.
   *
   *
   *
   *
   *
   *
   *
   *
   *
   *
   */

}
