package spring.basic.note;

public class ObjectOrientedPrinciple {

  /*
  self-taught
   * chapter03. 좋은 객체 지향 프로그래밍
   *
   * ◆ 객체 지향 프로그래밍이란?
   * -객체 지향 프로그래밍은 컴퓨터 프로그램을 명령어의 목록으로 보는 시각에서 벗어나 여러 개의 독립된 단위,
   *  즉 "객체"들간의 상호작용으로 파악하고자 하는 것이다.
   * -객체 지향 프로그래밍은 프로그램을 유연하고 변경이 용이하게 만들기 때문에 대규모 소프트웨어 개발에 많이 사용된다.
   *
   * ◆ 유연하고, 변경이 용이하다?
   * 마치 레고 블럭을 조립하듯이,
   * 자동차 타이어가 고장 났을때 타이어 부품만 교체하듯이,
   * 프로그램을 구성하는 각각의 컴포넌트 요소들을 쉽게 변경하면서 개발한다.
   * → Polymorphism 다형성
   * → 이 세상을 역할과 구현으로 구분지었다.
   * 역할 = 인터페이스
   * 구현 = 인터페이스를 구현한 구현 클래스, 구현 객체
   * 객체를 설계할 때 역할과 구현을 명확히 분리한다.
   * 역할(인터페이스)를 먼저 부여하고, 그 역할을 수행하는 구현 객체를 만든다.
   *
   * 운전자 역할   ▶       자동차 역할
   *                  ↗      ↑      ↖
   *                k3    아반테    테슬라 (구현 객체들)
   *
   * 운전자는 자동차 역할만 알고 있으면 된다. 그 자동차가 실제로 k3 인지, 아반테인지, 테슬라인지는 상관이 없다.
   * k3 를 운전하다가 아반테로 자동차를 변경하더라도 운전자에게는 아무 영향이 없이 계속 운전할 수 있다.
   * 운전자는 그저 자동차 역할만 알면 어떤 자동차든지 운전할 수 있기 때문이다.
   *
   * 결국 이렇게 역할과 구현을 분리해서 개발하게 되면,
   * 인터페이스를 구현한 객체 인스턴스를 실행 시점에 유연하게 변경할 수 있게 된다.
   * 즉, 클라이언트를 변경하지 않고 서버의 구현 기능을 유연하게 변경할 수 있다.
   *
   * ◆ 다형성의 한계
   * 역할(인터페이스)자체가 변하면, 클라이언트, 서버 모두에 큰 변경이 발생한다.
   * 그렇기에 첫 단계에서 인터페이스를 안정적으로 잘 설계하는 것이 중요하다.
   *
   * ◆ 스프링과 객체 지향
   * 객체 지향이 가진 궁극적인 본질은 다형성이다.
   * 그런데 객체 지향과 스프링이 무슨 상관이 있는걸까?
   * 스프링은 자바의 다형성을 극대화시켜주는 도구이기 때문이다.
   * 스프링에서 이야기하는 제어의 역전(IoC), 의존관계 주입(DI) 는 다형성을 활용해서 역할과 구현을 편리하게 다룰 수 있도록 지원한다.
   * 스프링을 사용하면 프로그램을
   * 마치 레고 블럭 조립하듯이,
   * 운전자가 자동차를 선택하듯이,
   * 구현을 편리하게 변경할 수 있다.
   *
   * ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   *
   * chapter04. 좋은 객체 지향 설계의 5가지 원칙 (SOLID)
   *
   * 클린 코드 책으로 유명한 로버트 마틴이 좋은 객체 지향 설계의 5가지 원칙을 정리하였다.
   *
   * SRP: 단일 책임 원칙
   * OCP: 개방-폐쇄 원칙
   * LSP: 리스코프 치환 원칙
   * ISP: 인터페이스 분리 원칙
   * DIP: 의존관계 역전 원칙
   *
   * ◆ SRP 단일 책임 원칙 - Single responsibility principle
   * - 하나의 클래스는 하나의 책임만을 가져야 한다.
   * - 하나의 책임이란? 정의하기 모호하다.
   * - 중요한 기준은 결국 변경이다. 어떠한 변경이 있을 때 그로 인한 파급 효과가 적어야지 단일 책임 원칙을 잘 따른 것.
   *
   * ◆ OCP 개방/폐쇄 원칙 - Open/Closed principle
   * - 소프트웨어 요소는 확장에는 열려 있으나 변경에는 닫혀 있어야 한다.
   * - 이런 마법 같은 말이? 확장을 하려면 당연히 기존 코드를 변경해야 하는 것이 아닌가?
   * - 인터페이스를 구현한 새로운 클래스를 만드는 것은 기존 코드를 변경하는 것은 아니다.
   *   ▶ 문제점 발생.
   *   MemberService 클라이언트가 구현 클래스를 직접 선택한다.
   *   MemberServiceRepository m = new MemoryMemberRepository(); // 기존 코드
   *   MemberServiceRepository m = new JdbcMemberRepository(); // 변경 코드
   *
   *   구현 객체를 변경하려면 클라이언트 코드를 변경해야 한다.
   *   분명히, 인터페이스를 바탕으로 한 다형성을 이용했지만 OCP 원칙을 지킬 수 없다.
   *   어떻게 이 문제를 해결할 것인가?
   *   객체를 생성하고, 연관 관계를 맺어주는 별도의 조립자, 설정자가 필요하다.
   *
   * ◆ LSP 리스코프 치환 원칙 - Liskov substitution principle
   * 프로그램 객체는 프로그램의 정확성을 깨뜨리지 않으면서 하위 타입의 인스턴스로 변경할 수 있어야 한다.
   * 다형성에서 하위 클래스는 인터페이스 규약을 다 지켜야 한다는 것, 다형성을 지원하기 위한 원칙,
   * 인터페이스를 구현한 구현체를 믿고 사용하려면 이 원칙이 필요하다.
   * - 단순한 컴파일 성공 유무를 말하는 것이 아니다.
   * - 자동차의 엑셀 인터페이스가 앞으로 전진하라는 기능으로 설계 되었다면 그 구현 객체들은 그 기능을 반드시 보장해야만 한다.
   *
   * ◆ ISP 인터페이스 분리 원칙 - Interface segregation principle
   * -특정 클라이언트를 위한 하나의 범용 인터페이스보다 여러 개로 분리된 작은 인터페이스가 낫다.
   * - 자동차 인터페이스 → 운전 인터페이스와 정비 인터페이스로 분리.
   * - 하나 하나의 인터페이스가 명확해야 하고, 대체가 쉬워야 한다.
   *
   * ◆ DIP 의존 관계 역전 원칙 - Dependency inversion principle
   * - 프로그래머는 "추상화에 의존해야지, 구체화에 의존해서는 안된다."
   * - 다시 말해, 구현 클래스에 의존하지 말고, 인터페이스에 의존해야 한다는 것이다.
   * - 앞서 이야기한 역할에 의존해야 한다는 것이다.
   *   ▶ 문제점 발생.
   *   MemberService 클라이언트가 구현 클래스를 직접 선택한다.
   *   MemberServiceRepository m = new MemoryMemberRepository(); // 기존 코드
   *   MemberServiceRepository m = new JdbcMemberRepository(); // 변경 코드
   *
   *   MemberService 는 인터페이스에 의존하지만, 구현 클래스에도 동시에 의존하고 있다.
   *   따라서 DIP 를 위반하는 것이 된다.
   *
   * ◆ 정리
   * 객체 지향의 핵심은 다형성
   * 그런데 실제 코드를 작성해보면 다형성만으로는 쉽게 부품을 갈아끼우듯 개발할 수 없다.
   * 구현 객체를 변경할 때 클라이언트 코드도 같이 변경해야만 하는 것이다.
   * 즉, 다형성만으로는 OCP, DIP 원칙을 지킬 수 없다.
   * 무엇인가가 더 필요하다.
   *
   * ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   *
   * chapter05. 다시 스프링으로
   * 스프링과 객체 지향은 서로 어떤 상관이 있을까?
   * 스프링은 자바 코드에 DI(Dependency Injection) 컨테이너를 제공함으로써 기존에 만족시키지 못했던 OCP, DIP 를 가능케 한다.
   * DI 컨테이너는 각 자바 객체들을 일종의 컨테이너에 넣고 관리하며 각 객체들간에 의존성을 대신 주입해준다.
   *
   * ◆ 스프링이 없던 시절로
   * 옛날 어떤 개발자가 좋은 객체 지향 원칙을 바탕으로 개발을 하려고 했다. SOLID 원칙을 지키면서 실제 코드를 작성해보니
   * 너무 해야할 일이 많았다. 즉 배보다 배꼽이 더 큰 상황이 되버린 것이다. 그래서 개발자는 그 해야할 일을 아예 그냥 하나의 프레임워크로 만들어 버렸다.
   * 순수하게 자바 코드를 이용하여 OCP, DIP 원칙들을 지키면서 개발을 하다보면 결국 스프링 프레임워크를 만들게 된다.(구체적으로는 DI 컨테이너)
   *
   * ◆ 정리
   * 모든 설계에 역할과 구현을 분리하자.
   * 애플리케이션 설계도 공연을 설계 하듯이 배역만 만들어두고, 배우는 언제든지 유연하게 교체될 수 있도록 만드는 것이 좋은 객체 지향 설계이다.
   * 이상적으로는 모든 설계에 인터페이스를 부여할 수 있다.
   * ▶ 현실적인 고민
   * 하지만 인터페이스를 도입하면 추상화라는 비용이 발생한다.
   * 미래에 기능이 확장될 가능성이 없다면, 일단 구체 클래스를 직접 사용하고 추후 리팩토링과 함께 인터페이스를 도입하는 것도 방법이 될 수 있다.
   *
   * ――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――――
   *
   * */

}
